package gojieba

import (
	"sort"
	"testing"
)

func TestExtract(t *testing.T) {

	dt := NewTokenizer("./dict/dict.txt")
	tfidf := NewTFIDF(dt, "./dict/idf.txt")
	t.Logf("%v\n", tfidf)

	s := "此外，公司拟对全资子公司吉林欧亚置业有限公司增资4.3亿元，增资后，吉林欧亚" +
		"置业注册资本由7000万元增加到5亿元。吉林欧亚置业主要经营范围为房地产开发及" +
		"百货零售等业务。目前在建吉林欧亚城市商业综合体项目。2013年，实现营业收入" +
		"0万元，实现净利润-139.13万元。"

	kws := tfidf.Extract(s, 20)
	t.Logf("%v\n", kws)

	got := make([]string, 0, len(kws))
	for _, kw := range kws {
		got = append(got, kw.GetWord())
	}

	want := []string{"欧亚", "吉林", "置业", "万元", "增资", "4.3", "7000", "2013",
		"139.13", "实现", "综合体", "经营范围", "亿元", "在建", "全资", "注册资本",
		"百货", "零售", "子公司", "营业"}

	sort.Strings(got)
	sort.Strings(want)

	checkResult(t, got, want)

	// Standard output from Python jieba
	//
	// [('欧亚', 0.7300142700289363),
	//  ('吉林', 0.659038184373617),
	//  ('置业', 0.4887134522112766),
	//  ('万元', 0.3392722481859574),
	//  ('增资', 0.33582401985234045),
	//  ('4.3', 0.25435675538085106),
	//  ('7000', 0.25435675538085106),
	//  ('2013', 0.25435675538085106),
	//  ('139.13', 0.25435675538085106),
	//  ('实现', 0.19900979900382978),
	//  ('综合体', 0.19480309624702127),
	//  ('经营范围', 0.19389757253595744),
	//  ('亿元', 0.1914421623587234),
	//  ('在建', 0.17541884768425534),
	//  ('全资', 0.17180164988510638),
	//  ('注册资本', 0.1712441526),
	//  ('百货', 0.16734460041382979),
	//  ('零售', 0.1475057117057447),
	//  ('子公司', 0.14596045237787234),
	//  ('营业', 0.13920178509021275)]
}
